In [3]:
import numpy as np
import pandas as pd

student_perfomance = pd.read_csv('https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv')
student_perfomance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [35]:
arr = []
for i in range(1000):
    if i % 2 == 0:
        arr.append(True) 
    else:
        arr.append(False)
student_perfomance.loc[arr]
student_perfomance.loc[(student_perfomance.gender == 'female') & (student_perfomance.lunch == 'standard'), 
                       ['gender','writing score']
]

     gender  writing score
0    female             74
1    female             88
2    female             93
5    female             78
6    female             92
..      ...            ...
984  female             82
986  female             51
991  female             78
995  female             95
998  female             77

[329 rows x 2 columns]

In [43]:
writing_mean = student_perfomance['writing score'].mean()
student_perfomance.loc[student_perfomance['writing score'] > writing_mean]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
...,...,...,...,...,...,...,...,...
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [70]:
student_perfomance.loc[student_perfomance['writing score'] > writing_mean]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
...,...,...,...,...,...,...,...,...
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [80]:
student_perfomance.loc[student_perfomance.lunch ==  "free/reduced"].shape[0] / student_perfomance.shape[0]

0.355

In [108]:
print('Standard lunch')
student_perfomance.loc[student_perfomance.lunch == 'standard',['math score', 'reading score', 'writing score']].mean()

Standart lunch

math score       70.034109
reading score    71.654264
writing score    70.823256
dtype: float64

In [104]:
student_perfomance.loc[student_perfomance.lunch == 'standard',['math score', 'reading score', 'writing score']].var()

math score       186.418089
reading score    191.285560
writing score    205.620887
dtype: float64

In [107]:
print('reduced lunch')
student_perfomance.loc[student_perfomance.lunch == 'free/reduced',['math score', 'reading score', 'writing score']].mean()

reduced lunch

math score       58.921127
reading score    64.653521
writing score    63.022535
dtype: float64

In [106]:
student_perfomance.loc[student_perfomance.lunch == 'free/reduced',['math score', 'reading score', 'writing score']].var()

math score       229.824270
reading score    221.871139
writing score    238.202881
dtype: float64

In [114]:
# QUERY and RENAIMG

subset_1 = my_stat.query('V1 > 0 & V3 == "A"')

In [115]:
mean_level = 90
student_perfomance = student_perfomance.rename(columns = {
    "parental level of education" : "parental_level_of_education",
    "test preparation course" : "test_preparation_course",
    "math score" : "math_score", "reading score" : "reading_score",
    "writing score" : "writing_score"
})
student_perfomance.query("math_score > @mean_level").head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
34,male,group E,some college,standard,none,97,87,82
104,male,group C,some college,standard,completed,98,86,90
114,female,group E,bachelor's degree,standard,completed,99,100,100
121,male,group B,associate's degree,standard,completed,91,89,92
149,male,group E,associate's degree,free/reduced,completed,100,100,93

In [118]:
student_perfomance.filter(like = "score").head()

   math_score  reading_score  writing_score
0          72             72             74
1          69             90             88
2          90             95             93
3          47             57             44
4          76             78             75

In [123]:
student_perfomance.query("math_score > @mean_level").filter(like = "0"  ,axis = 0)

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
104,male,group C,some college,standard,completed,98,86,90
306,male,group E,some college,standard,completed,99,87,81
501,female,group B,associate's degree,standard,completed,94,87,92
503,female,group E,associate's degree,standard,completed,95,89,92
710,male,group C,some college,standard,completed,93,84,90
903,female,group D,bachelor's degree,free/reduced,completed,93,100,100
950,male,group E,high school,standard,none,94,73,71